{
    "url": "https://astro.build/themes/details/astral-portfolio-theme/",
    "name": "astral-portfolio-theme",
    "title": "Astral Portfolio Theme",
    "desc": "Astral is a sleek, minimal portfolio theme built with Tailwind CSS and designed for creative professionals who value clean aesthetics and performance. With a framework-agnostic approach, Astral seamlessly adapts to your favorite stack, ensuring you can integrate it into any workflow. Subtle animations and a fully responsive design create a refined user experience that puts your work front and center.",
    "article": "<h2>Key Features</h2><ol><li><strong>Minimal, Modern Aesthetic - </strong>Clean typography and generous whitespace help focus attention on your visuals and written content.</li><li><strong>Tailwind CSS Integration - </strong>Out-of-the-box utility classes streamline styling, making customization quick and effortless.</li><li><strong>Framework-Agnostic - </strong>Use Astral with any framework or setup you prefer—React, Vue, Svelte, or a plain HTML workflow—no limitations.</li><li><strong>Subtle Animations - </strong>Delicate hover effects and transitions add polish without overwhelming the user experience.</li><li><strong>Fully Responsive - </strong>Optimized layouts scale beautifully from mobile screens to large desktops, ensuring consistent presentation everywhere.</li><li><strong>SEO &amp; Performance-Friendly - </strong>Lightweight structure and best-practice semantics help your portfolio rank higher and load faster.</li><li><strong>Easy Customization - </strong>Simple file organization and flexible Tailwind utilities let you personalize color schemes, fonts, and layouts quickly.</li></ol><h2>Included Pages</h2><p>Home, About, Project Landing Page, Project Listing, Blog Landing Page, Blog Article, Contact, Privacy, Coming Soon, 404, Documentation</p><h2>Who It’s For</h2><ul><li><strong>Freelancers &amp; Creatives</strong>: Designers, photographers, illustrators—anyone who wants a visually striking yet subtle space to exhibit their work.</li><li><strong>Agencies &amp; Teams</strong>: Present case studies, team bios, and services in a polished, professional manner.</li><li><strong>Content Creators</strong>: Whether you write tutorials or share creative insights, the blog layout supports engaging, reader-friendly content.</li></ul><h2>Why Choose Astral?</h2><ul><li><strong>Blazing-Fast Setup</strong>: Tailwind CSS utilities and an easy file structure let you launch quickly.</li><li><strong>Limitless Flexibility</strong>: Framework-agnostic design means you can integrate Astral anywhere—no constraints.</li><li><strong>Polished Experience</strong>: Subtle animations and consistent design ensure your portfolio feels both modern and approachable.</li></ul><p><br/></p><p><strong>Elevate your online presence with Astral.</strong> This light, minimal theme merges Tailwind’s efficiency, framework-agnostic flexibility, and carefully crafted design to showcase your work with clarity and sophistication. Get started today and let your creativity shine.</p>",
    "typeUrl": "https://buy.polar.sh/polar_cl_AGm4weTu4QVvwWYhyXWXDdIYmVrjZOes4hP1P0yQquj",
    "liveUrl": "https://astral-portfolio-theme.vercel.app/",
    "type": "buy",
    "imgs": [
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2F25s53xw555p7743ct24ay89f3jy84mm1bkv7xo.webp&w=1600&h=900&f=webp"
    ]
}