{
    "url": "https://astro.build/themes/details/craftpixel-portfolio-for-graphic-designer/",
    "name": "craftpixel-portfolio-for-graphic-designer",
    "title": "Craftpixel - Portfolio for Graphic Designer",
    "desc": "Craftpixel is a premium astro portfolio template meticulously crafted for graphic designers seeking to showcase their creativity with style and functionality",
    "article": "<p><strong>Craftpixel</strong> is a premium astro portfolio template meticulously crafted for graphic designers seeking to showcase their creativity with style and functionality. Built with Tailwind CSS, Craftpixel combines a sleek, modern design with a highly customizable and responsive layout, ensuring your designs shine across all devices. Whether you're a branding expert, UI/UX designer, or digital illustrator, this template empowers you to create a professional online presence that captures the essence of your creative vision.</p><p>Craftpixel captivates with a visually stunning hero section that immerses visitors in a meticulously crafted digital workspace, designed to resonate with graphic designers. The hero features a sleek computer desk setup, complete with a MacBook displaying a dynamic screen with a typing animation, a responsive keyboard with interactive hover effects, and creative elements like a sketchbook with a pencil, a Pantone color guide, and a coffee cup. These details, enhanced by subtle animations and a vibrant lime-accented aesthetic, create an inspiring first impression that mirrors a designer’s creative environment.</p><h2><strong>🔥</strong>Key Features:</h2><ul><li>Responsive Design: Fully responsive layout optimized for desktops, tablets, and smartphones.</li><li>Tailwind CSS Framework: Utility-first CSS for rapid customization without extensive custom styles.</li><li>Interactive Portfolio: Filterable portfolio grid with smooth transitions for seamless project navigation.</li><li>Modal: Simple Modal lightbox integration for an immersive showcase of your design work.</li><li>SEO Optimized: Semantic HTML, proper heading tags, and alt attributes to enhance search engine visibility.</li><li>Fast Loading: Optimized code and image handling for quick page loads and improved user experience.</li><li>Cross-Browser Compatibility: Tested for consistent performance across Chrome, Firefox, Safari, and Edge.</li><li>Blog &amp; Insights: Engaging blog system with detailed posts to share design expertise.</li></ul><h2>📚Template Includes:</h2><ul><li>Homepage: A dynamic landing page tailored for graphic designers.</li><li>About: Highlight your creative journey and professional background.</li><li>Services: Showcase your design services, from branding to UI/UX.</li><li>Portfolio: Interactive gallery to display your design projects.</li><li>Pricing: Pricing Plans</li><li>Blogs: Blog card list to share insights and trends.</li><li>Blog Detail: Detailed article page.</li><li>Contact: Professional contact form for client inquiries.</li><li>Privacy Policy: Comprehensive privacy page for transparency.</li><li>Terms of Service: Professional terms page for service agreements.</li><li>Documentation: Full setup and customization guide for easy implementation.</li></ul><h2><strong>⚡</strong>Quick Setup:</h2><ul><li>Download and unzip the Craftpixel template.</li><li>Run <strong>npm install</strong> to install dependencies.</li><li>Start the development server:<strong> npm run dev (</strong>http://localhost:4321/<strong>)</strong></li><li>Customize colors, content, and layouts using Tailwind utilities.</li><li>Build for production: <strong>npm run build</strong></li></ul><h2><strong>🛠️</strong>Tech Stack:</h2><ul><li>Tailwind CSS: Rapid styling with utility classes.</li><li>Vanilla JavaScript: Lightweight interactivity, no jQuery needed.</li><li>Build System: <strong>Astro Build</strong> for efficient workflows.</li></ul><h2><strong>🆓</strong>Free Updates &amp; Support</h2><p>Craftpixel includes free future updates to keep your portfolio fresh. Need help? Contact us</p><p>Note: Craftpixel is available in <strong>Static HTML</strong> Template and <strong>Astro Build Template</strong>.</p><p><br/></p><p>With Craftpixel, you can focus on showcasing your design portfolio while the template handles the technical details, making it the perfect choice for graphic designers looking to elevate their online presence.</p><p><br/></p><p>Ready to build your dream portfolio? Get Craftpixel today!</p>",
    "typeUrl": "https://portfolios.gumroad.com/l/craftpixel",
    "liveUrl": "https://portfolio.tailwindtemplate.net/craftpixel-astro",
    "type": "buy",
    "imgs": [
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Fi20a416x0ld9cce46hup3f0gqrashvgefsctkn.webp&w=1600&h=900&f=webp"
    ]
}