{
    "url": "https://astro.build/themes/details/flowbite/",
    "name": "flowbite",
    "title": "Flowbite",
    "desc": "A free and open-source admin dashboard template built by the core Flowbite team that gives you access to UI components like charts, widgets, tables, CRUD layouts based on the Flowbite design system.",
    "article": "\n<h2>Flowbite Astro Admin Dashboard</h2>\n<p>This project is a free and open-source UI admin dashboard template built with the components from <a href=\"https://flowbite.com\" rel=\"nofollow ugc\">Flowbite</a> and based on the utility-first <a href=\"https://github.com/tailwindlabs/tailwindcss\" rel=\"nofollow ugc\">Tailwind CSS</a> framework featuring charts, tables,\n    widgets, CRUD layouts, modals, drawers, and more.</p>\n<p>This admin dashboard can quickly help you get started building an application for your project using the newest UI/UX\n    development technologies in the open-source area including Tailwind CSS and Flowbite.</p>\n<h3>Built with Flowbite</h3>\n<p>The interactive components such as the navbars, modals, drawers, and tooltips are all based on the popular\n    open-source component library called <a href=\"https://github.com/themesberg/flowbite\" rel=\"nofollow ugc\">Flowbite</a> which enables\n    us to use these elements by creating more complex set of pages and widgets inside a fully-fledged admin dashboard\n    template.</p>\n<h3>Tailwind CSS classes</h3>\n<p>All of the pages, widgets, and components are solely based on the utility-first classes from <a href=\"https://tailwindcss.com/\" rel=\"nofollow ugc\">Tailwind CSS</a> and it is compatible with the latest v3.x of the technology\n    by automatically purging all of the classes based on the template paths.</p>\n<h3>15 example pages</h3>\n<p>Get started with 15 advanced examples pages including two different layouts of a dashboard's homepage full of charts\n    widgets, tables, datepickers, and statistics and also with two CRUD layout pages for products, users, a settings\n    page, authentication pages for login and register and even custom 404 and 500 error pages.</p>\n<h3>Advanced UI components</h3>\n<p>This admin dashboard contains many advanced components both from Flowbite but also from other third-party libraries\n    such as ApexCharts which have been customly tailored with Tailwind CSS classes and designed based on the <a href=\"https://flowbite.com/figma/\" rel=\"nofollow ugc\">Flowbite Design System</a>.</p>\n<h3>Flowbite Documentation</h3>\n<p>If you want to use this project we recommend to also study the <a href=\"https://flowbite.com/docs/getting-started/quickstart/\" rel=\"nofollow ugc\">component library</a> that we used to build this\n    dashboard because you can use even more components from that library to enhance the examples that we've coded here\n    already.</p>\n<h3>Development workflow</h3>\n<p>This template was built with <a href=\"https://astro.build/\">Astro</a>, <a href=\"https://flowbite.com/\" rel=\"nofollow ugc\">Flowbite</a> and <a href=\"https://tailwindcss.com/\" rel=\"nofollow ugc\">Tailwind CSS</a>.</p>\n<ol>\n<li>Clone this repository or download the ZIP file</li>\n<li>Make sure that you have Node.js and NPM, PNPM or Yarn installed</li>\n<li>Install the project dependencies from the package.json file:</li>\n</ol>\n<pre>pnpm install</pre>\n<p>PNPM is the package manager of choice for illustration, but you can use what you want.</p>\n<p>Launch the Astro local development server on localhost:2121 by running the following command:</p>\n<pre>pnpm run dev</pre>\n<p>You can also build the project and get the distribution files inside the dist/ folder by running:</p>\n<pre>pnpm run build</pre>\n<p>Then, you can preview the generated build with a local web server:</p>\n<pre>pnpm run preview</pre>\n<p>For deployment, see the GitHub workflow, where you can plug your target (pre-configured for GitHub pages). See <a href=\"https://docs.astro.build/en/guides/deploy\" rel=\"nofollow ugc\">Astro's deployment docs</a> for more details.</p>\n<p>Website is configured for static deployment, but you can flip it to Server-Side rendering by simply uncommenting\n    output: \"server\" in the ./astro.config.mjs.</p>\n<p>For more information on how to get started and what tools were you please check out the <a href=\"https://github.com/themesberg/flowbite-astro-admin-dashboard\" rel=\"nofollow ugc\">official repository on GitHub.</a></p>\n",
    "typeUrl": "https://github.com/themesberg/flowbite-astro-admin-dashboard",
    "liveUrl": "https://themesberg.github.io/flowbite-astro-admin-dashboard/",
    "type": "free",
    "github": {
        "html_url": "https://github.com/themesberg/flowbite-astro-admin-dashboard",
        "name": "flowbite-astro-admin-dashboard",
        "full_name": "themesberg/flowbite-astro-admin-dashboard",
        "description": "Open-source admin dashboard template built with Astro, Flowbite, and Tailwind CSS",
        "stargazers_count": 714,
        "created_at": "2023-03-02T15:44:13Z",
        "updated_at": "2025-08-07T23:14:24Z",
        "pushed_at": "2023-12-09T23:09:06Z",
        "git_url": "git://github.com/themesberg/flowbite-astro-admin-dashboard.git",
        "ssh_url": "git@github.com:themesberg/flowbite-astro-admin-dashboard.git",
        "clone_url": "https://github.com/themesberg/flowbite-astro-admin-dashboard.git",
        "homepage": "https://themesberg.github.io/flowbite-astro-admin-dashboard/"
    },
    "imgs": [
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Fflowbite-hero.webp&w=1600&h=900&f=webp"
    ]
}