{
    "url": "https://astro.build/themes/details/foliograph-photography-portfolio-template/",
    "name": "foliograph-photography-portfolio-template",
    "title": "Foliograph - Photography Portfolio Template",
    "desc": "Foliograph is a portfolio template crafted with Tailwind CSS and Astro designed specifically for photographers, Gallery and visual storytellers. Its dark, elegant aesthetic with vibrant yellow accents creates a captivating showcase for your photography, blending sophistication with bold creativity.",
    "article": "<p>Foliograph is a sleek, modern portfolio template crafted with Tailwind CSS and Alpinejs, designed specifically for <strong>photographers, Gallery</strong> and <strong>visual storytellers</strong>. Its dark, elegant aesthetic with vibrant yellow accents creates a captivating showcase for your photography, blending sophistication with bold creativity. 📸 Perfect for portrait, landscape, or event photographers, Foliograph ensures your work shines with style and professionalism.</p><p><br/></p><p>🎯 Built for photographers, freelancers, and creative professionals, Foliograph combines a minimalist dark theme with dynamic functionality, delivering a fast, responsive, and SEO-optimized portfolio that leaves a lasting impression.</p><h2>✨ Key Features:</h2><ul><li>🌑 Dark Elegance Design – Striking dark theme with yellow gradient accents for a premium look</li><li>🛠️ Tailwind CSS Powered – Fully customizable with utility-first styling</li><li>⚡ Blazing Fast – Lightweight and optimized for top performance</li><li>📱 Responsive &amp; Mobile-First – Flawless display on desktops, tablets, and phones</li><li>🔍 SEO-Optimized – Clean, semantic markup for better search visibility</li><li>🎬 Interactive Animations – Smooth reveal effects and hover transitions</li><li>🧩 Alpine.js Integration – Lightweight interactivity for menus and dynamic elements</li></ul><h2>📂 Included Pages:</h2><ul><li>🏠 Home (Hero, Gallery, Profile, Service, Reviews, Contact)</li><li>📝 Blogs (Photography Tips, Techniques, and Trends)</li><li>📰 Blog Detail (In-Depth Articles with Related Posts)</li><li>🛡️ Privacy Policy (Professional Legal Page)</li><li>📜 Terms of Service (Clear Usage Terms)</li><li>📚 Documentation (Step-by-Step Setup Guide)</li></ul><h2>⚡ Quick Setup:</h2><ol><li>Open <strong>'foliograph-astro'</strong> from the code editor</li><li>Run <strong>npm install </strong>to install dependencies</li><li>Start the dev server: <strong>npm run dev </strong>(http://localhost:4321/)</li><li>Customize styles, images, and content</li><li>Build for production: <strong>npm run build</strong></li></ol><h2>❤️ Why Choose Foliograph?</h2><ol><li>🎨 Tailored for Photographers – Showcase your portfolio with stunning image-focused layouts</li><li>✨ Elegant Animations – Subtle reveal effects and hover interactions add sophisticatio</li><li>🖼️ Pixel-Perfect Visuals – Montserrat and Raleway fonts for modern typography</li><li>💥 Built for Impact – Ideal for photographers, studios, and creative freelancers</li></ol><h2>🛠️ Tech Stack:</h2><ul><li>⚡ Astro Build System</li><li>🌀 Tailwind CSS</li><li>🏔️ Alpine.js</li><li>🖼️ Font Awesome 6</li><li>✨Glightbox and Splide js</li></ul><h2>🆓 Free Updates &amp; Support</h2><p>Foliograph includes free updates to keep your portfolio fresh and modern. </p><p>🎉 Ready to showcase your photography with elegance and impact? Get Foliograph today! 🚀</p>",
    "typeUrl": "https://portfolios.gumroad.com/l/foliograph",
    "liveUrl": "https://portfolio.tailwindtemplate.net/foliograph-astro/",
    "type": "buy",
    "imgs": [
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2F2yhgne7ll12zy0uoswawysdacnok7dd4tesyuo.webp&w=1600&h=900&f=webp",
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Fg8m2y0jnoop0zoax7al0pui96rxlpct2961j84.webp&w=1600&h=900&f=webp",
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Fkenh386dtb8h8yju98s3eqyj3i7qwjqtap4xz5.webp&w=1600&h=900&f=webp"
    ]
}