{
    "url": "https://astro.build/themes/details/galaxy/",
    "name": "galaxy",
    "title": "Galaxy",
    "desc": "A stunning SaaS template with full i18n capabilities, Keystatic CMS, blog, and more. Built with Astro v5 and Tailwind CSS v4.",
    "article": "<p><em>Save weeks of time and get a SaaS landing page and blog running in a snap.</em></p><p>Galaxy is the perfect way to introduce your new idea to the world. It is designed to convert visitors into customers, featuring a modern design and sections that you would want. It also has a built in blog for engaging with potential customers. Built with Astro v5 and Tailwind CSS v4, and integrated with Keystatic CMS for easy content editing.</p><p>With tons of features to make your life easy:</p><ul><li>Full Internationalization (i18n) capabilities with tons of utility functions, examples, and components. Easily configurable with a setup script \"npm run config-i18n\"</li><li>Keystatic CMS integration for blog posts, authors, and other pages, with a great interface and rich text editor</li><li>Easy-to-use, with data and config files for important items on the website. You donât have to go digging through thousands of lines of code to change the site title.</li><li>Over 100 components. Including 9 feature sections, 3 hero sections, 3 pricing sections, 2 testimonial sections, 2 faq sections, 2 logo clouds, login, signup, 404, contact, legal, blog index, cookie banner, and 2 blog post layouts.</li><li>Built-in image optimization with Astro.</li><li>Built-in MDX blog with markdown frontmatter validation, and multiple author support.</li><li>Scroll-based animations that are easily customizable, or can be disabled with a one-line config change.</li><li>Boring SEO stuff like OG tags, Twitter cards, and other metadata - already taken care of.</li><li>View transitions enabled, with a one-line config change to disable.</li><li>Fully responsive.</li></ul><h2>Keystatic CMS</h2><p>Keystatic is included in this theme, allowing non-technical editors to easily edit blog posts, authors, and other pages. It is a local / git based CMS so all content still lives in your repo in MDX files. Donât want to use it? Simple run \"npm run remove-keystatic\" to remove it and it's dependencies from the project.</p><h2>Further Info</h2><p>If you have any questions feel free to reach out at:</p><ul><li> <a href=\"https://twitter.com/BowTiedWebReapr\" rel=\"nofollow ugc\">x.com/bowtiedwebreapr</a> or <a href=\"https://twitter.com/cosmic_themes\" rel=\"nofollow ugc\">x.com/cosmic_themes</a></li><li><a href=\"mailto:creator@cosmicthemes.com\" rel=\"nofollow ugc\">creator@cosmicthemes.com</a></li></ul><p>On Cosmic Themes, there is also a bundle that includes all existing themes, all new themes that release, and all future updates. Read more at <a href=\"https://cosmicthemes.com/all-access/\" rel=\"nofollow ugc\">Cosmic Themes All Access</a></p>",
    "typeUrl": "https://cosmicthemes.com/themes/galaxy/",
    "liveUrl": "https://galaxy.cosmicthemes.com/",
    "type": "buy",
    "imgs": [
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Fkmgsjbrcmm9v2d23vzk9ps0m4xxlui8ttciist.webp&w=1600&h=900&f=webp",
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Fzgtj7jgljd5u3m625uya533s3pfrez5i3j3a8h.webp&w=1600&h=900&f=webp",
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Fijvn5uwgrhy89qqb6rvi575eme15palpji27yx.webp&w=1600&h=900&f=webp",
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Fnxttj87p26dze2dgei9gorv1ieo125dv866buf.webp&w=1600&h=900&f=webp",
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Fs1c0xdo088j6aktrfy24m4agkh9sumw6zit6pi.webp&w=1600&h=900&f=webp"
    ]
}