{
    "url": "https://astro.build/themes/details/resume06/",
    "name": "resume06",
    "title": "Resume06",
    "desc": "This template allows you to present your skills and achievements on the Internet with an innovative website for which you do not need to write a single line of code.",
    "article": "<p>Resume06 is a website template that simplifies the process of developing a website for your resume. It has never been simpler to showcase your website creatively. This template allows you to present your skills and achievements on the Internet with an innovative website for which you do not need to write a single line of code.</p><p><br/></p><p>It is a beautifully designed template that is specially designed to highlight your achievements and build trust. Creating an appealing and professional-looking resume website is no longer an ordeal when you select this template.</p><p>All it takes to launch a full-fledged resume website is installing and configuring the template to meet your requirements. By opting for this creative template for Astro, you will not spend hours setting up a website on your desk. Simply configure it, enter your details, and your resume website is ready to launch.</p><h2>Key Features</h2><p><br/></p><ul><li>Three Home Pages available which user can choose which one to display</li><li>You can easily toggle your home page on changing these dropwdown values in Personal Information collection</li><li>Dark And Light Mode</li><li>RTL (Right to Left) and LTR (Left to Right) Mode</li><li>Easy customization options</li><li>User-friendly and convincing interface</li><li>Easy to edit</li><li>No coding required</li><li>Downloadable CV option for the reader</li><li>Portfolio details with all client details</li><li>Service details with all the Services you provide</li><li>Showcase your Expert Areas, Skills, Education, Experience, Partners</li><li>Showcase your Projects and also Client Feedback on Project</li><li>Special sections like About Us, Resume Details, Portfolio, Contact, Blogs, Services</li><li>TinaCms Connected</li></ul><p><br/></p>",
    "typeUrl": "https://acquaint.gumroad.com/l/astro-resume06",
    "liveUrl": "https://astro-resume06.vercel.app/",
    "type": "buy",
    "imgs": [
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2F4yxvnn4empngq22vw2zec6vm1vkixonhuhr6vq.webp&w=1600&h=900&f=webp",
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2F1msgpbc1duvmuml9oy2szq839hex6wly48h9uq.webp&w=1600&h=900&f=webp",
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Fukh912l5yt8wizn26n188sq1s5yg9m09wn5rt7.webp&w=1600&h=900&f=webp",
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Fdz9j2zcywqcu0vgvy7oyb7yuz9mvwu83jsmr9j.webp&w=1600&h=900&f=webp",
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Ftu62u7mmwzmp14dogeok08ka7jsju67gu5zksq.webp&w=1600&h=900&f=webp"
    ]
}