{
    "url": "https://astro.build/themes/details/super-cool-portfolio-template/",
    "name": "super-cool-portfolio-template",
    "title": "Super cool portfolio template",
    "desc": "This project is built with Astro and Tailwind CSS, and it's designed to showcase skills, projects, certifications, and provide an easy way to contact the author.",
    "article": "<h2><strong>Portfolio Template - Developer's Showcase</strong></h2><p><strong>A modern and professional portfolio template for web developers, featuring a minimalist design, high speed, and optimized performance. Designed to meet the latest web design standards, this template offers a streamlined, efficient way to showcase your work.</strong></p><p><strong>Built with Astro, it combines static content with modern web features, all while maintaining fast performance and a focus on clean design.</strong></p><h3><strong>Key Features</strong></h3><p><strong>Clean and Modern Design</strong></p><ul><li>A minimalist aesthetic focused on readability and user experience.</li><li>A neutral color palette with subtle accents to highlight important elements, optimized for visual clarity and energy efficiency.</li></ul><p><strong>Dark Mode Support</strong></p><ul><li>Switch seamlessly between light and dark modes, enhancing the user experience for different preferences and environments.</li><li>Dark mode is fully integrated, ensuring a smooth transition without affecting performance.</li></ul><p><strong>Typography and Visual Hierarchy</strong></p><ul><li>A modern System-ui and Mangueira typeface, ideal for developers.</li><li>Consistent and responsive typographic hierarchy, optimized for both mobile and desktop devices.</li></ul><p><strong>Optimized for Speed and SEO</strong></p><ul><li>Files optimized for fast load times and high performance, with 100/100 Lighthouse scores.</li><li>Built-in SEO features to ensure your portfolio is easily discoverable.</li><li>Image and Font Preloading: Ensures faster loading by preloading images and essential fonts, reducing delays when rendering content.</li><li>SVG Optimization: All SVG assets are optimized to reduce file size while maintaining quality, resulting in faster loading and smoother transitions.</li></ul><p><strong>Animations</strong></p><ul><li>Smooth and engaging animations are integrated throughout the site, enhancing interactivity and user experience without compromising performance.</li></ul><p><strong>Accessibility and Usability</strong></p><ul><li>Enhanced accessibility with semantic HTML and good contrast ratios.</li><li>Clear, straightforward navigation to enhance the user experience.</li></ul><p><strong>Additional Features</strong></p><ul><li>Mobile-first approach, ensuring a seamless experience on all devices.</li><li>Ready for deployment on platforms like Vercel and Cloudflare Pages.</li><li>A moderate number of components designed to cover essential sections without overwhelming complexity.</li><li>Optimized color palette designed to minimize eye strain and enhance readability, ensuring a smooth experience for users in all lighting conditions.</li></ul><p>This template is perfect for developers looking to showcase their work in a professional, efficient, and elegant way. With a modular structure and responsive design, you can customize every aspect of your portfolio with ease.</p><h3><strong>Learn More About the Portfolio Template</strong></h3><p><strong>Create a standout portfolio that balances performance and professional aesthetics. Discover how this template can help you build a unique online presence.</strong></p><h3><strong>Contact</strong></h3><p>For inquiries or collaboration opportunities, feel free to reach out to me at agustinaltamirano2024@gmail.com.</p>",
    "typeUrl": "https://www.paypal.com/paypalme/agusalta/39.99",
    "liveUrl": "https://port-aa.netlify.app/",
    "type": "buy",
    "imgs": [
        "https://astro.build/_image?href=https%3A%2F%2Fstorage.googleapis.com%2Fdev-portal-bucket%2Fnee3u8wdbr7zpa42lzzes1eie5y20f1fhh5bfl.webp&w=1600&h=900&f=webp"
    ]
}