export default {
  menus: [{
    href: '#home',
    label: 'الرئيسية',
    key: 'home',
  }, {
    href: '#about',
    label: 'معلومات عنا',
    key: 'about',
  }, {
    href: '#service',
    label: 'الخدمات',
    key: 'service',
  }, {
    href: '#sites',
    label: 'المواقع',
    key: 'site',
  }, {
    href: '#contact',
    label: 'اتصل بنا',
    key: 'contact',
  }],
  btn: {
    back: "عودة",
    siter: "معرض المواقع",
    contact: "اتصل بنا",
  },
  html_head: {
    title: "قائمة المواقع الصفحة {{page}}",
  },
  about: {
    who: {
      name: "من نحن؟",
      content: [{
        title: "فريق التصميم والتطوير",
        desc: [
          "نحن فريق مكون من مطورين ومصممين.",
          "نستخدم مهاراتنا لمساعدة الأصدقاء على بناء بنية تحتية إنترنتية للمؤسسات. في السنوات الأخيرة، شهد الإنترنت تطورًا كبيرًا، فإلى جانب جودة المنتجات، تحتاج الشركات إلى عرض منتجاتها وتصميم شعارها وحزمها عبر الإنترنت لتعريف العملاء بها."
        ],
      }]
    },
    service: {
      name: "مقدمة عن الخدمات",
      content: [{
        title: 'مجال التطوير',
        desc: [
          "يتمتع مطورونا بخبرة تزيد عن 7 سنوات، ويجيدون تطوير الواجهة الأمامية والخلفية، وتطوير برامج الزحف وقواعد البيانات.",
          "نقدم خدمات تطوير مواقع باستخدام تقنيات حديثة للواجهة الأمامية والخلفية، مع التركيز على التفاعل وتجربة المستخدم، ونساعد العملاء في تحسين ترتيب مواقعهم عبر محركات البحث (SEO)."
        ],
        goto: 'زيارة مدونة التقنية',
        url: 'https://howduudu.tech/blog/home/',
      }, {
        title: 'مجال التصميم',
        desc: [
          "مصممنا خريج إحدى أربع كليات فنية كبرى، متخصص في تصميم العلامات التجارية، وتصميم التغليف، وتصميم الشعارات، ويجيد استخدام أدوات أدوبي مثل فوتوشوب، إليستريتور، وإن ديزاين.",
          "تشمل أعمال المصمم قطاعات العقارات، والصناعة، والتجارة الخارجية، ويتمتع بخبرة واسعة وأفكار تصميم فريدة.",
        ],
        goto: 'زيارة معرض الأعمال',
        url: 'https://rabbitit.fun'
      }],
    }
  },
  pros: {
    title: 'مميزاتنا',
    desc: "نقدم خدمات تطوير مواقع مخصصة كاملة، بما في ذلك التطوير، وتسجيل النطاقات، والنشر، والصيانة. يمكنك اختيار نموذج موقع أو موقع تهتم به، ونقوم بتطويره حسب احتياجاتك. كما نقدم خدمات جمع البيانات والاختراق العكسي للمواقع، ضمن إطار القانون. إذا كنت بحاجة إلى تصميم شعار أو علامة تجارية أو تغليف، يمكننا أيضاً تقديم هذه الخدمات بأعلى جودة.",
    infos: [{
      title: 'تطوير المواقع',
      img: '/images/sitestar/img1.svg',
      small: 'تطوير مواقع حديث بفصل الواجهة الأمامية عن الخلفية',
      p: 'تطوير صفحات SPA باستخدام React وVue، وتطوير صفحات مع عرض من جانب الخادم باستخدام Astro وNext.js.',
    }, {
      title: 'تخصيص 100%',
      img: '/images/sitestar/img2.svg',
      small: 'تصميم عرض الموقع حسب متطلبات العميل مع عناصر تعكس التميز',
      p: 'العديد من المواقع تبدو متشابهة بسبب استخدام قوالب جاهزة. نحن نقدم تطوير مخصص بأسعار القوالب لمساعدتك على التميز.',
    }, {
      title: 'تسجيل النطاق والإيداع',
      img: '/images/sitestar/img3.svg',
      small: 'تسجيل النطاق عبر علي بابا كلاود ومساعدة الشركات في تسجيل ICP مع وزارة الصناعة وتكنولوجيا المعلومات',
      p: 'قبل تشغيل الموقع في الصين، يجب تقديم طلب التسجيل في وزارة الصناعة وتكنولوجيا المعلومات (ICP) مع مستندات الشركة، وتستغرق العملية حوالي 7 أيام.',
    }, {
      title: 'صداقة SEO',
      img: '/images/sitestar/img4.svg',
      small: 'تحسين ترتيب الموقع في محركات البحث',
      p: 'يقوم العملاء بالبحث عن المنتجات في جوجل، بايدو وغيرها، والمواقع الصديقة لـ SEO تظهر في النتائج الأولى.',
    }, {
      title: 'دعم SSL',
      img: '/images/sitestar/img15.svg',
      small: 'حماية نقل البيانات لتجنب إعادة التوجيه الإعلانية أو التلاعب',
      p: 'تُطلب جميع الطلبات عبر https، والمتصفحات تحول تلقائيًا من http إلى https.',
    }, {
      title: 'استضافة الموقع',
      img: '/images/sitestar/img6.svg',
      small: 'الاستضافة على خوادم سحابية مثل علي بابا كلاود وتينسنت كلاود',
      p: 'يمكن إضافة ميزات مخصصة مثل الحماية من هجمات DDoS وتسريع CDN.',
    }, {
      title: 'الاختراق العكسي وجمع البيانات',
      img: '/images/sitestar/img7.svg',
      small: 'جمع بيانات من مواقع محددة ودعم الاختراق العكسي للمواقع المحمية',
      p: 'جمع البيانات يتم وفقًا للقوانين مع إمكانية معالجتها وتحليلها بصريًا.',
    }, {
      title: 'خدمات الخلفية',
      img: '/images/sitestar/img8.svg',
      small: 'خدمات الخلفية باستخدام Python وNodeJS',
      p: 'مثل توفير واجهات برمجية لدعم وظائف مواقع أخرى أو تطبيقات صغيرة مثل الضرائب.',
    }, {
      title: 'تصميم العلامة التجارية',
      img: '/images/sitestar/img9.svg',
      small: 'بناء وتعزيز هوية العلامة التجارية والثقة والربط العاطفي',
      p: 'ننقل القيم والرؤية الأساسية للعلامة التجارية بطريقة منظمة إلى الجمهور المستهدف عبر العناصر البصرية واللفظية.',
    }, {
      title: 'تصميم الشعار',
      img: '/images/sitestar/img10.svg',
      small: 'تصميم شعارات احترافية للشركات',
      p: 'تصميم شعار يتناسب مع هوية وتوجه الشركة، ذو استراتيجية وقصة، ليس فقط جميلًا بل سهل التمييز والتذكر.',
    }, {
      title: 'تصميم التغليف',
      img: '/images/sitestar/img11.svg',
      small: 'تصميم إبداعي يجمع بين الجمالية والوظيفية لتغليف المنتج',
      p: 'التغليف هو الجسر الأول بين المنتج والمستهلك، ينقل قيمة العلامة التجارية ويجذب الانتباه ويعزز المبيعات.',
    }],
  },
  contact: {
    title: 'أضفني وأرسل طلباتك',
    wechat_tip: 'امسح رمز الاستجابة السريعة لإضافة صديق على وي تشات',
    qq_tip: 'امسح رمز الاستجابة السريعة لإضافة صديق على QQ',
    tip: "إذا كنت بحاجة إلى تطوير مواقع، تطوير بيانات أو تصميم علامة تجارية، اتصل بنا! لدينا مهندسون ومصممون محترفون في خدمتك. يُفضل التواصل عبر وي تشات، أو عبر البريد الإلكتروني:",
  },
  siter: {
    title: 'معرض المواقع',
    desc: "يمكنك تصفح معرض المواقع، اختيار المواقع أو الميزات التي تحبها، وسنقوم بتصميم وتطوير صفحات مواقع بناءً على اختيارك. جميع المواقع في المعرض هي مواقع طرف ثالث، ونحن لا نعيد استخدام أكواد المواقع الأصلية، لذلك لا توجد مخاطر حقوق نشر.",
    more: 'عرض المزيد',
  },
  header: {
    tip: 'مطور\n✨ومصمم\nخاص بك✨',
  },
  footer: {
    cr: 'جميع الحقوق محفوظة.',
    icp: 'ICP License No. 2022020686, Shanghai',
  },
  preview: {
    tip: 'رابط غير صالح، يرجى التحقق:',
    desktop: 'كمبيوتر',
    tablet: 'لوحي',
    mobile: 'جوال',
    full: 'شاشة كاملة',
    loading: 'جاري التحميل...',
  },
  page_404: {
    oops: 'عذرًا!',
    tip: 'الصفحة التي تحاول الوصول إليها غير موجودة. هل عنوان الصفحة صحيح؟',
    home: 'الذهاب إلى الصفحة الرئيسية',
  },
}

